In [1]:
%matplotlib inline
import numpy as np
import pandas as pd
from pandas import Series,DataFrame
import matplotlib.pyplot as plt

## Series,类似一维数组的对象,对数据建立对应索引.

In [2]:
s=Series([1,2,3,4])
s

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
s[1]

2

In [4]:
s.values

array([1, 2, 3, 4])

In [5]:
s.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj2=Series([1,2,3,4,-1],index=['a','b','f','f','e'])
obj2

a    1
b    2
f    3
f    4
e   -1
dtype: int64

In [7]:
obj2['f']

f    3
f    4
dtype: int64

In [8]:
obj2[['f','a']]

f    3
f    4
a    1
dtype: int64

In [9]:
obj2.index

Index([u'a', u'b', u'f', u'f', u'e'], dtype='object')

In [10]:
obj2[obj2>1]

b    2
f    3
f    4
dtype: int64

In [11]:
obj2*2

a    2
b    4
f    6
f    8
e   -2
dtype: int64

In [12]:
obj2**2

a     1
b     4
f     9
f    16
e     1
dtype: int64

In [13]:
obj2-2*obj2

a   -1
b   -2
f   -3
f   -4
e    1
dtype: int64

Series可以看做一个定长的字典对象

In [14]:
df = {'step':2,'huy':1,'yue':13}
Series(df)

huy      1
step     2
yue     13
dtype: int64

In [15]:
obj2.index=['str','ret','tyr','rett','ert']
obj2

str     1
ret     2
tyr     3
rett    4
ert    -1
dtype: int64

In [16]:
obj2.name= 'haa'
obj2.index.name='index'

In [17]:
obj2

index
str     1
ret     2
tyr     3
rett    4
ert    -1
Name: haa, dtype: int64

## DataFrame表格型数据结构

In [18]:
data={'state':['Anhui','Beijing','Tianjing','hubei','jiangxi'],'Year':[2011,2012,2013,2014,2015],'pop':[1.1,1.2,1.6,2.1,2.8]}
frame=DataFrame(data)
frame

   Year  pop     state
0  2011  1.1     Anhui
1  2012  1.2   Beijing
2  2013  1.6  Tianjing
3  2014  2.1     hubei
4  2015  2.8   jiangxi

In [19]:
DataFrame(data,columns=['pop','state','jojo','Year'])

   pop     state jojo  Year
0  1.1     Anhui  NaN  2011
1  1.2   Beijing  NaN  2012
2  1.6  Tianjing  NaN  2013
3  2.1     hubei  NaN  2014
4  2.8   jiangxi  NaN  2015

In [20]:
frame['pop']

0    1.1
1    1.2
2    1.6
3    2.1
4    2.8
Name: pop, dtype: float64

In [21]:
frame.state

0       Anhui
1     Beijing
2    Tianjing
3       hubei
4     jiangxi
Name: state, dtype: object

In [22]:
frame2=DataFrame(data,columns=['pop','state','jojo','Year'],index=['h','d','m','f','n'])

In [23]:
frame2

   pop     state jojo  Year
h  1.1     Anhui  NaN  2011
d  1.2   Beijing  NaN  2012
m  1.6  Tianjing  NaN  2013
f  2.1     hubei  NaN  2014
n  2.8   jiangxi  NaN  2015

In [24]:
frame2['jojo']=2
frame2

   pop     state  jojo  Year
h  1.1     Anhui     2  2011
d  1.2   Beijing     2  2012
m  1.6  Tianjing     2  2013
f  2.1     hubei     2  2014
n  2.8   jiangxi     2  2015

In [25]:
frame2['steern']=np.array([1,2,3,4,5])
frame2

   pop     state  jojo  Year  steern
h  1.1     Anhui     2  2011       1
d  1.2   Beijing     2  2012       2
m  1.6  Tianjing     2  2013       3
f  2.1     hubei     2  2014       4
n  2.8   jiangxi     2  2015       5

In [26]:
val=Series(['a','r','g'],index=['h','n','f'])
frame2['sterr']=val
frame2

   pop     state  jojo  Year  steern sterr
h  1.1     Anhui     2  2011       1     a
d  1.2   Beijing     2  2012       2   NaN
m  1.6  Tianjing     2  2013       3   NaN
f  2.1     hubei     2  2014       4     g
n  2.8   jiangxi     2  2015       5     r

In [27]:
del frame2['steern']#删除特定列

In [28]:
frame2

   pop     state  jojo  Year sterr
h  1.1     Anhui     2  2011     a
d  1.2   Beijing     2  2012   NaN
m  1.6  Tianjing     2  2013   NaN
f  2.1     hubei     2  2014     g
n  2.8   jiangxi     2  2015     r

In [29]:
frame2.T #转置产生一个新的DataFrame

           h        d         m      f        n
pop      1.1      1.2       1.6    2.1      2.8
state  Anhui  Beijing  Tianjing  hubei  jiangxi
jojo       2        2         2      2        2
Year    2011     2012      2013   2014     2015
sterr      a      NaN       NaN      g        r

In [30]:
frame2

   pop     state  jojo  Year sterr
h  1.1     Anhui     2  2011     a
d  1.2   Beijing     2  2012   NaN
m  1.6  Tianjing     2  2013   NaN
f  2.1     hubei     2  2014     g
n  2.8   jiangxi     2  2015     r

In [31]:
pop=np.array([['as','asd','uju'],['yu','io','tyty']])
DataFrame(pop,index=['j','e'])

    0    1     2
j  as  asd   uju
e  yu   io  tyty

## 索引对象

In [32]:
frame2.index #Index对象无法修改

Index([u'h', u'd', u'm', u'f', u'n'], dtype='object')

In [33]:
frame2.columns

Index([u'pop', u'state', u'jojo', u'Year', u'sterr'], dtype='object')

In [34]:
frame2

   pop     state  jojo  Year sterr
h  1.1     Anhui     2  2011     a
d  1.2   Beijing     2  2012   NaN
m  1.6  Tianjing     2  2013   NaN
f  2.1     hubei     2  2014     g
n  2.8   jiangxi     2  2015     r

In [35]:
frame2.index.is_unique

True

In [36]:
frame2.index.is_monotonic

False

In [37]:
insex =  frame2.index

In [38]:
s=insex.drop('h')
s

Index([u'd', u'm', u'f', u'n'], dtype='object')

In [39]:
insex

Index([u'h', u'd', u'm', u'f', u'n'], dtype='object')

In [40]:
d=insex.insert(2,'w')
d

Index([u'h', u'd', u'w', u'm', u'f', u'n'], dtype='object')

## 基本功能

### 重新索引

In [41]:
obj=Series([2.3,3.1,1.1,2.5,3.3],index=['a','e','c','t','f'])
obj

a    2.3
e    3.1
c    1.1
t    2.5
f    3.3
dtype: float64

In [42]:
obj2=obj.reindex(['a','b','c','d'])
obj2

a    2.3
b    NaN
c    1.1
d    NaN
dtype: float64

In [43]:
obj.reindex(['a','b','d','e','g'],fill_value=0.1)

a    2.3
b    0.1
d    0.1
e    3.1
g    0.1
dtype: float64

In [44]:
obj3=Series([2.3,3.1,1.1,2.5,3.3],index=[0,2,4,6,8])
obj3.reindex(range(9),method='bfill')#原Series对象的index必需为递增或者递减序列,才可以使用method

0    2.3
1    3.1
2    3.1
3    1.1
4    1.1
5    2.5
6    2.5
7    3.3
8    3.3
dtype: float64

In [45]:
obj3.reindex(range(9),method='ffill')

0    2.3
1    2.3
2    3.1
3    3.1
4    1.1
5    1.1
6    2.5
7    2.5
8    3.3
dtype: float64

In [46]:
frame = DataFrame(np.arange(9).reshape((3,3)),index=['a','c','d'],columns=['Ohio','Texas','California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [47]:
frame.reindex(['a','b','c','d'])

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [48]:
frame.reindex(columns=['Texas','Utah','Ohio'])

   Texas  Utah  Ohio
a      1   NaN     0
c      4   NaN     3
d      7   NaN     6

In [49]:
frame.reindex(index=['a','b','c','d'],columns=['Texas','Utah','Ohio'])

   Texas  Utah  Ohio
a    1.0   NaN   0.0
b    NaN   NaN   NaN
c    4.0   NaN   3.0
d    7.0   NaN   6.0

In [50]:
frame.reindex(index=['a','b','c','d'],columns=['Texas','Utah','Ohio'],method='ffill')

   Texas  Utah  Ohio
a      1   NaN     0
b      1   NaN     0
c      4   NaN     3
d      7   NaN     6

In [51]:
frame.ix[['a','b','c','d'],['Texas','Utah','Ohio']]

   Texas  Utah  Ohio
a    1.0   NaN   0.0
b    NaN   NaN   NaN
c    4.0   NaN   3.0
d    7.0   NaN   6.0

In [52]:
frame.ix[:,['Texas','Utah','Ohio']]

   Texas  Utah  Ohio
a      1   NaN     0
c      4   NaN     3
d      7   NaN     6

In [53]:
obj.drop('c')

a    2.3
e    3.1
t    2.5
f    3.3
dtype: float64

In [54]:
obj.drop(['a','c'])

e    3.1
t    2.5
f    3.3
dtype: float64

In [55]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [56]:
frame.drop('a')

   Ohio  Texas  California
c     3      4           5
d     6      7           8

In [57]:
frame.drop(['a','d'])

   Ohio  Texas  California
c     3      4           5

In [58]:
frame.drop('Ohio',axis=1)

   Texas  California
a      1           2
c      4           5
d      7           8

In [59]:
frame.drop('a',axis=0)

   Ohio  Texas  California
c     3      4           5
d     6      7           8

In [60]:
frame.T[['a','c']]

            a  c
Ohio        0  3
Texas       1  4
California  2  5

In [61]:
frame['Ohio']

a    0
c    3
d    6
Name: Ohio, dtype: int64

In [62]:
frame[frame['Texas']<7]

   Ohio  Texas  California
a     0      1           2
c     3      4           5

In [63]:
frame[:4]

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [64]:
frame['a':'c']

   Ohio  Texas  California
a     0      1           2
c     3      4           5

In [65]:
obj[1:3]

e    3.1
c    1.1
dtype: float64

In [66]:
obj['a':'t']

a    2.3
e    3.1
c    1.1
t    2.5
dtype: float64

In [67]:
obj[['t','a']]

t    2.5
a    2.3
dtype: float64

In [68]:
obj

a    2.3
e    3.1
c    1.1
t    2.5
f    3.3
dtype: float64

In [69]:
obj['e':'t']=7.8
obj

a    2.3
e    7.8
c    7.8
t    7.8
f    3.3
dtype: float64

In [70]:
obj[obj>3]

e    7.8
c    7.8
t    7.8
f    3.3
dtype: float64

## 算术运算和数据对齐

In [71]:
s1=Series(range(7),index=list('abcdefg'))
s2=Series(range(4),index=list('abcd'))
s1+s2

a    0.0
b    2.0
c    4.0
d    6.0
e    NaN
f    NaN
g    NaN
dtype: float64

In [72]:
s1.add(s2,fill_value=1) #填充了S2上的缺失值

a    0.0
b    2.0
c    4.0
d    6.0
e    5.0
f    6.0
g    7.0
dtype: float64

In [73]:
frame=DataFrame(np.arange(10).reshape((2,5)),columns=list('abcde'))
frame

   a  b  c  d  e
0  0  1  2  3  4
1  5  6  7  8  9

## 函数应用和映射

In [74]:
frame=DataFrame(np.arange(15).reshape((3,5)),index=['JiangXi','TianJing','NanChang'],columns=list('abcde'))
frame

           a   b   c   d   e
JiangXi    0   1   2   3   4
TianJing   5   6   7   8   9
NanChang  10  11  12  13  14

In [75]:
np.abs(frame)

           a   b   c   d   e
JiangXi    0   1   2   3   4
TianJing   5   6   7   8   9
NanChang  10  11  12  13  14

In [76]:
f=lambda x:x.max()-x.min()
frame.apply(f,axis=0)

a    10
b    10
c    10
d    10
e    10
dtype: int64

In [77]:
frame.apply(f,axis=1)

JiangXi     4
TianJing    4
NanChang    4
dtype: int64

## 排序

In [78]:
obj = Series([1,4,2,6,5],index=['a','c','h','f','o'])
obj

a    1
c    4
h    2
f    6
o    5
dtype: int64

In [79]:
obj.sort_index()

a    1
c    4
f    6
h    2
o    5
dtype: int64

In [80]:
obj.sort_values()

a    1
h    2
c    4
o    5
f    6
dtype: int64

In [81]:
obj.sort_index(ascending=False)

o    5
h    2
f    6
c    4
a    1
dtype: int64

In [82]:
frame.sort_index()

           a   b   c   d   e
JiangXi    0   1   2   3   4
NanChang  10  11  12  13  14
TianJing   5   6   7   8   9

In [83]:
frame.sort_index(axis=1,ascending=False)

           e   d   c   b   a
JiangXi    4   3   2   1   0
TianJing   9   8   7   6   5
NanChang  14  13  12  11  10

In [84]:
frame.sort_values(by='b',ascending=False)

           a   b   c   d   e
NanChang  10  11  12  13  14
TianJing   5   6   7   8   9
JiangXi    0   1   2   3   4

In [88]:
def deco(func):
    def _deco(*args, **kwargs):
        print 'before invoked'
        ret = func(*args, **kwargs)
        print 'after invoded'
        return ret
    return _deco
 
@deco
def f(a):
    print 'f is invoked'
    return a + 1

f(3)

before invoked
f is invoked
after invoded

4